namespace AppTesting
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Пирамида тестирования
            // Уровень 1. Unit Tests (юнит-тесты, модульные тесты)
            // Они тестируют отдельные компоненты или функции, чтобы убедиться, что они работают должным образом в изолированных условиях

            // Уровень 2. Integration Tests
            // По сути, это тесты, которые проверяют взаимодействие фрагмента кода с внешними компонентами (например, взаимодействие с базой данных или внешним почтовым сервером)

            // Уровень 3. E2E Tests
            // Проверяет, что приложение работает безупречно от начала до конца.


            // Рассмотрим два популярных фреймворка для модульного тестирования: NUnit и XUnit
        }
    }
}
